app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author = current_user.name
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "body", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)